Repository: OSGeo/grass-legacy
Catalog: locale/po/grasstcl_*.po
Languages: cs

source: Rectify maps in group
cs: Rektifikovat mapy ve skupinÏ

source: Quit
cs: UkonËit

source: Exit georectifier
cs: Spustit proces georektifikov·nÌ

source: Display active layers
cs: Zobrazit aktivnÌ vrstvy

source: Set ground control points
cs: Nastavit vlÌcovacÌ body

source: Zoom In
cs: ZvÏtπit

source: Zoom Out
cs: Zmenπit

source: Pan
cs: Posun

source: Zoom to map
cs: ZvÏtπit podle mapovÈ vrstvy

source: Creating MainFrame...
cs: Vytv·¯Ìm MainFrame...

source: Welcome to GRASS GIS
cs: VÌtejte v GRASS GIS

source: Workspace
cs: PracovnÌ oblast

source: Georectify
cs: Georektifikace

source: Create ps.map file for postscript printing
cs: Vytvo¯it soubor ps.map pro tisk do postscriptovÈho souboru

source: Start new map display monitor
cs: Zaloæit novou mapovou vrstvu

source: Add histogram layer
cs: P¯idat vrstvu s histogramem

source: Add cell values layer
cs: P¯idat rastrovou vrstvu

source: Add directional arrows layer
cs: P¯idat vrstvu se smÏrovou r˘æicÌ

source: Add raster legend layer
cs: P¯idat vrstvu s legendou

source: Add raster labels layer (using v.labels file)
cs: P¯idat vrstvu s rastrov˝mi popisky (s vyuæitÌm souboru vytvo¯enÈho v.labels)

source: Add postscript labels layer (using v.labels file)
cs: P¯idat vrstvu s popisky ve form·tu postscript (s vyuæitÌm souboru vytvo¯enÈho v.labels)

source: Add postscript text layer
cs: P¯idat vrstvu s textem ve form·tu postscript

source: geodetic grid
cs: zemÏpisn· m¯Ìæka

source: grid & text color
cs: barva m¯Ìæky & textu

source: draw border text
cs: vykreslit r·meËek okolo textu

source: border color
cs: barva r·meËeku

source: include null values
cs: obsahuje pr·zdnÈ hodnoty

source: Labels file:
cs: Soubor s popisky:

source: labels file to display
cs: soubor s popisky k zobrazenÌ

source: Legend appearance: text color
cs: Vzhled legendy: barva textu

source: do not display labels
cs: nezobrazovat popisky

source: do not display values
cs: nezobrazovat hodnoty

source: invert legend
cs: invertovat legendu

source: draw smooth gradient (fp maps)
cs: vykreslit vyhlazen˝ gradient (mapovÈ vrstvy s plovoucÌ desetinnou Ë·rkou)

source: skip categories with no labels
cs: p¯eskoËit kategorie bez popisk˘

source: Save current display geometry to named region
cs: Uloæit souËasn˝ v˝¯ez do pojmenovanÈho regionu

source: Enter region name
cs: Zadejte jmÈno regionu

source: Override offset, alignment, and color settings in v.labels file:
cs: PotlaËit offset, zarovn·nÌ a barevnÈ nastavenÌ v souboru v.labels:

source: Align label with vector object:
cs: Zarovnat popisek s vektorov˝m objektem:

source: Offset label from vector object:
cs: Odsadit popisek od vektorovÈho objektu:

source: x offset
cs: odsazenÌ ve smÏru x

source: y offset
cs: odsazenÌ ve smÏru y

source: Justification:
cs: Zarovn·nÌ:

source: select font for label
cs: vybrat pÌsmo pro popisek

source: Postscript and LPR printing of map display
cs: Tisk zobrazenÈ mapy LPR nebo do form·tu Postscript

source: Preset paper type
cs: NastavenÌ typu papÌru

source: Custom paper size
cs: Uæivatelsk· velikost papÌru

source: height:
cs: v˝πka:

source: Margins left:
cs: Lev˝ okraj:

source: right:
cs: prav˝:

source: top:
cs: hornÌ:

source: bottom:
cs: dolnÌ:

source: Resolution (dpi) for printing and PDF
cs: RozliπenÌ (dpi) pro tisk a PDF soubor

source: Send to LPR printer*
cs: Odeslat na tisk·rnu LPR

source: Send to postscript device*
cs: Odeslat na postscriptovÈ za¯ÌzenÌ*

source: Save to PDF file*
cs: Uloæit do souboru PDF*

source: Save to EPS file
cs: Uloæit do souboru EPS

source: *requires ghostscript to be installed and in path
cs: *vyæaduje instalovan˝ ghostscript a cestu k nÏmu

source: justification
cs: zarovn·nÌ

source: select font for text
cs: vyberte pÌsmo pro text

source: Redraw all layers
cs: P¯ekreslit vπechny vrstvy

source: Start NVIZ using active layers in current region
cs: Spustit NVIZ s aktivnÌmi vrstvami v aktu·lnÌm regionu

source: Pointer
cs: Ukazatel

source: Zoom to...
cs: ZvÏtπit na...

source: Measure
cs: MÏ¯it

source: Create profile of raster map
cs: Vytvo¯it profil rastrovÈ vrsvy

source: Print raster & vector maps to eps file
cs: Tisknout rastrovÈ & vektorovÈ mapovÈ vrstvy do souboru eps

source: Export display to graphics file
cs: Exportovat obsah do grafickÈho souboru

source: Constrain map to region geometry
cs: Omezit mapu podle geometrie regionu

source: Map fills display window
cs: Vyplnit mapu obsah okna

source: Select raster map to profile. Currently selected raster is default.
cs: Vyberte rastrovou mapu pro profil V˝chozÌ je souËasn· oznaËen· rastrov· mapa.

source: Draw profile transect in map display
cs: Vykreslit profil v mapovÈm oknÏ

source: Draw profile
cs: Vykreslit profil

source: Clear profile
cs: Smazat profil

source: Save profile to EPS file
cs: Uloæit profil do souboru EPS

source: Please wait while profile elevations are calculated
cs: ProsÌm poËkejte chvÌli, neæ bude vypoËÌt·n profil elevace

source: scale factor for computing arrow length
cs: mÏ¯Ìtkov˝ faktor pro v˝poËet dÈlky πipky

source: base raster map to display
cs: z·kladov· rastrov· mapov· vrstva

source: raster map to drape over base map
cs: rastrov· mapov· vrstva p¯ekr˝vajÌcÌ z·kladovou mapu

source: use raster colors for cell values
cs: pouæÌt rastrovÈ barvy pro hodnoty bunÏk

source: raster map for red or hue channel
cs: rastrov· mapa pro kan·l ËervenÈ nebo jasu

source: raster map for green or intensity channel
cs: rastrov· mapa pro kan·l zelenÈ nebo intenzity

source: raster map for blue or saturation channel
cs: rastrov· mapa pro kan·l modrÈ nebo sytosti

source: Run (Background)
cs: Spustit (na pozadÌ)

source: Run UI
cs: Spustit UI

source: Run in Xterm
cs: Spustit v p¯ÌkazovÈ konzoli (Xterm)

source: Output - GIS.m
cs: V˝stup - GIS.m

source: vector for thematic mapping
cs: vektorov· vrstva pro tÈmatickou mapu

source: show data
cs: zobrazit data

source: Graduated colors: preset color schemes
cs: OdstupÚovanÈ barvy: urËit schÈma barev

source: Legend: title font
cs: Legenda: pÌsmo titulku

source: title font for legend
cs: pÌsmo titulku legendy

source: subtitle font
cs: pÌsmo podtitulku

source: subtitle font for legend
cs: pÌsmo podtitulku legendy

source: label font
cs: pÌsmo popisku

source: label font for legend
cs: pÌsmo popisku legendy

source: Clear legend
cs: VyËistit legendu

source: Save legend to EPS file
cs: Uloæit legendu do souboru EPS

source: vector map to display
cs: vektorov· mapa k zobrazenÌ

source: Display:
cs: Zobrazit:

source: text color
cs: barva textu

source: text size
cs: velikost textu

source: label part to align with vector point
cs: Ë·st popisku pro zarov·nÌ s vektorov˝m bodem

source: justification
cs: zarovn·nÌ

source: Query vectors for display:
cs: Dotazovat vektorovÈ vrstvy pro zobrazenÌ:

source: query cat values
cs: dotazovat hodnoty karegoriÌ

source: use SQL query
cs: pouæÌt SQL dotaz

source: save displayed objects to new vector file
cs: uloæit zobrazenÈ objekty do novÈho vektorovÈ souboru

source: overwrite existing
cs: p¯epsat existujÌcÌ

source: new vector
cs: nov· vektorov· vrstva

source: select existing vector for saving queried objects
cs: vybrat existujÌcÌ vektorovou vrstvu pro uloæenÌ dotazovan˝ch objekt˘

source: Welcome to v.digit
cs: VÌtejte v modulu v.digit

source: Left mouse button
cs: LevÈ tlaËÌtko myπi

source: Middle mouse button
cs: St¯ednÌ tlaËÌtko myπi

source: Right mouse button
cs: PravÈ tlaËÌtko myπi

source: Layer
cs: Vrstva

source: Category
cs: Kategorie

source: Mode
cs: MÛd

source: Insert new record into table
cs: Vloæit nov˝ z·znam do tabulky

source: Digitize new point
cs: Digitalizaovat nov˝ bod

source: Digitize new line
cs: Digitalizovat novou linii

source: Digitize new boundary
cs: Digitalizovat novou hraniËnÌ linii

source: Digitize new centroid
cs: Digitalizovat nov˝ centroid

source: Move vertex
cs: P¯emÌstit opÏrn˝ bod

source: Add vertex
cs: P¯idat opÏrn˝ bod

source: Remove vertex
cs: Odstranit opÏrn˝ bod

source: Split line
cs: RozdÏlit linie

source: Edit line/boundary
cs: Editovat linii/hraniËnÌ linii

source: Move point, line, boundary, or centroid
cs: P¯emÌstit bod, linii, hraniËnÌ linii nebo centroid

source: Delete point, line, boundary, or centroid
cs: Odstranit bod, linii, hraniËnÌ linii nebo centroid

source: Redraw
cs: P¯ekreslit

source: Zoom in by window
cs: ZvÏtπit podle okna

source: Zoom out
cs: Zmenπit

source: Zoom to default region
cs: ZvÏtπit podle v˝chozÌ regionu

source: Zoom to region
cs: ZvÏtπit podle regionu

source: Display categories
cs: Zobrazit kategorie

source: Copy categories
cs: KopÌrovat kategorie

source: Display attributes
cs: Zobrazit atributy

source: Open settings
cs: Otev¯Ìt nastavenÌ

source: Save and exit
cs: Uloæit a ukonËit

source: mouse button actions (left, middle, right)
cs: akce tlaËÌtek myπi (levÈ, prost¯ednÌ, pravÈ)

source: Add new column
cs: P¯idat nov˝ sloupec

source: Create table
cs: Vytvo¯it tabulku

source: Add command
cs: P¯idat p¯Ìkaz

source: Table successfully created
cs: Tabulka byla ˙spÏπnÏ vytvo¯ena

source: Symbology
cs: Symbolika

source: Background
cs: PozadÌ

source: Highlight
cs: Zv˝raznÏnÌ

source: Point
cs: Bod

source: Line
cs: Linie

source: Boundary (no area)
cs: HraniËnÌ linie (nikoliv plocha)

source: Boundary (1 area)
cs: HraniËnÌ linie (1 plocha)

source: Boundary (2 areas)
cs: HraniËnÌ linie (2 plochy)

source: Centroid (in area)
cs: Centroid (uvnit¯ plochy)

source: Centroid (outside area)
cs: Centroid (vnÏ plochy)

source: Centroid (duplicate in area)
cs: Centroid (duplictnÌ uvnit¯ plochy)

source: Node (1 line)
cs: Uzel (1 linie)

source: Node (2 lines)
cs: Uzel (2 linie)

source: Settings
cs: NastavenÌ

source: Snapping threshold in screen pixels
cs: Pr·hov· hodnota p¯ichycenÈ v obrazov˝ch pixelech

source: Snapping threshold in map units
cs: Pr·hov· hodnota p¯ichycenÌ v mapov˝ch jednok·ch

source: Line width (pixels; 0 is finest)
cs: ©Ì¯ka linie (pixelyl; 0 je nejtenπÌ)

source: Table
cs: Tabulka

source: Delete
cs: Smazat

source: Categories
cs: Kategorie

source: Layer:
cs: Vrstva:

source: Category:
cs: Kategorie:

source: Insert new record to table
cs: Vloæit nov˝ z·znam do tabulkyTabelle

source: Add new
cs: P¯idat nov˝

source: Raster 2.5D map to volume
cs: 2.5D mapa na objem

source: &Imagery
cs: &Obrazov˝ soubor

source: Start/select display monitor x0
cs: Otev¯Ìt/vybrat grafick˝ monitor x0

source: Start/select display monitor x1
cs: Otev¯Ìt/vybrat grafick˝ monitor x1

source: Start/select display monitor x2
cs: Otev¯Ìt/vybrat grafick˝ monitor x2

source: Start/select display monitor x3
cs: Otev¯Ìt/vybrat grafick˝ monitor x3

source: Start/select display monitor x4
cs: Otev¯Ìt/vybrat grafick˝ monitor x4

source: Start/select display monitor x5
cs: Otev¯Ìt/vybrat grafick˝ monitor x5

source: Start/select display monitor x6
cs: Otev¯Ìt/vybrat grafick˝ monitor x6

source: Define location using projection information in georeferenced file
cs: Zaloæit location podle informacÌ o projekci z georeferencovanÈho souboru

source: Choose georeferenced file
cs: Cesta ke georeferencovanÈmu souboru

source: WARNING: invalid location
cs: UPOZORNÃNÕ: neplatn· location

source: Warning: location <%s> at GISDBASE <%s> is not a directory or does not exist.
cs: Varov·nÌ: locatio <%s> v GISDBASE <%s> nenjÌ adres·¯ nebo neexistuje.

source: Warning: selected location <%s> is not valid. New mapset is NOT created. Select valid location and try again.
cs: Varov·nÌ: vybran· location <%s> nenÌ platn·. Nov˝ mapset NEBYL vytvo¯en. Vyberte platnou location azkuste to znovu-

source: Warning: selected location <%s> is not valid. Select valid location and try again.
cs: Varov·nÌ: vybran· location <%s> nenÌ platn·. Vyberte platnou location a zkuste to znova.

source: Warning: selected location <%%s> is not valid. Select valid location and try again.
cs: Varov·nÌ: vybran· locatio <%%s> nenÌ platn·. Vyberte platnou location a zkuste to znovu.

source: Warning: <%%s> is not a valid mapset
cs: Varov·nÌ: <%%s> nenÌ platn˝ mapset
