Repository: OSGeo/grass-legacy
Catalog: locale/po/grasstcl_*.po
Languages: cs

source: Output
cs: V˝stup

source: Options
cs: Volby

source: Run
cs: Spustit

source: Help
cs: N·povÏda

source: Clear
cs: VyËistit

source: Close
cs: Zav¯Ìt

source: required
cs: vyæadov·no

source: optional
cs: volitelnÈ

source: multiple
cs: mnohon·sobnÈ

source: New GIS data directory
cs: Nov˝ adres·¯ s GIS daty

source: Cancel
cs: UkonËit

source: GRASS %s Startup
cs: GRASS %s spuπtÏnÌ

source: The world's leading open source GIS
cs: CelosvÏtovÏ rozπÌ¯en˝ open source GIS

source: Select an existing project location and mapset
cs: Vyberte existujÌcÌ location projektu a mapset

source: or define a new location
cs: oder definieren Sie eine neue Location.

source: GIS Data Directory:
cs: Adres·¯ s daty GIS:

source: Browse...
cs: ProhlÌæet...

source: Project Location (projection/coordinate system)
cs: Location projektu (projekce/sou¯adn˝ systÈm)

source: Accessible Mapsets (directories of GIS files)
cs: P¯ÌtomnÈ mapsety (adres·¯e s daty GIS)

source: Create new mapset in selected location
cs: Vytvo¯it nov˝ mapset ve vybranÈ location

source: Create new mapset
cs: Vytvo¯it nov˝ mapset

source: Define new location with...
cs: Definovat novou location location s ...

source: Georeferenced file
cs: Georeferencovan˝ soubor

source: EPSG codes
cs: KÛdy EPSG

source: Projection values
cs: Hodnoty projekce

source: Enter GRASS
cs: Spustit GRASS

source: WARNING: invalid mapset
cs: UPOZORNÃNÕ: neplatn˝ mapset

source: Warning: <%s> is not a valid mapset
cs: UpozornÏnÌ: <%s> nenÌ platn˝ mapset

source: Help already opened
cs: N·povÏda je jiæ otev¯ena

source: Exit
cs: Konec

source: WARNING: Invalid Database
cs: UPOZORNÃNÕ: Neplatn· datab·ze

source: WARNING: Invalid database. Finding first valid directory in parent tree
cs: UpozornÏnÌ: Neplatn· datab·ze. Hled·m prvnÌ platn˝ adres·¯ v adres·¯ovÈm stromÏ

source: Name of new location
cs: N·zev novÈ location

source: Path to new location
cs: Cesta k novÈ location

source: Path to the EPSG-codes file
cs: Cesta k souboru s EPSG k√≥dy

source: EPSG code number of projection
cs: ƒå√≠slo EPSG k√≥du projekce

source: WARNING: epsg-codes file not found
cs: UPOZORNƒöN√ç: soubor s EPSG k√≥dy nebyl nalezen

source: WARNING: The epsg-codes file was not found!
cs: UPOZORNƒöN√ç: Soubor s EPSG k√≥dy nebyl nalezen!

source: Define location
cs: Definovat location

source: WARNING: location exists
cs: UPOZORNÃNÕ: location jiæ existuje

source: WARNING: restart GRASS please
cs: VAROV√ÅN√ç: pros√≠m, restartujte GRASS

source: WARNING: Please restart GRASS in order find the created location in the list (closing it for you now)
cs: VAROV√ÅN√ç: Pro zobrazen√≠ zalo≈æen√© location v tomto seznamu je pot≈ôeba restartovat GRASS (zav≈ô√≠t jej nyn√≠)

source: EPSG CODES (from file: %s)
cs: K√≥dy EPSG (ze souboru: %s)

source: GUESS THAT IS NOT THE EPSG FILE
cs: MYSL√çM, ≈ΩE TOTO NEN√ç SOUBOR S EPSG K√ìDY

source: CREATION OF A NEW GRASS LOCATION WITH EPSG
cs: VYTVO≈òIT NOVOU GRASS LOCATION S EPSG

source: - needed parameters -
cs: - pot≈ôebuje parametry -

source: Name of new location:
cs: N·zev novÈ location:

source: Requires as input the name of the new location to be created
cs: Je poæadov·n n·zev vytv·¯enÈ novÈ location

source: Path to location:
cs: Cesta k location:

source: The folder (GRASS database) in which the location should be created
cs: Adres√°≈ô (GRASS database) v nƒõm≈æ m√° b√Ωt location vytvo≈ôena

source: EPSG code number of projection:
cs: ƒå√≠slo EPSG k√≥du projekce:

source: EPSG code number of projection (see /usr/local/share/proj/epsg or push the 'EPSG-codes' button)
cs: ƒå√≠slo EPSG k√≥du projekce (viz /usr/local/share/proj/epsg nebo stisknƒõte tlaƒç√≠tko'EPSG-codes')

source: Path to georeferenced file
cs: Cesta ke georeferencovanÈmu souboru

source: WARNING: file not found
cs: UPOZORNÃNÕ: soubor nebyl nalezen

source: WARNING: The file was not found!
cs: UPOZORNÃNÕ: Soubor nebyl nalezen!

source: CREATING A NEW GRASS LOCATION USING GEOREFERENCED FILE
cs: VYTVOÿIT NOVOU GRASS LOCATION NA Z¡KLADÃ GEOREFERENCOVAN… SOUBORU

source: The file must have georeferencing information readable
cs: Soubor musÌ obsahovat ËitelnÈ informace o georeferenci

source: by GDAL or OGR, and GRASS must be compiled with GDAL and OGR.
cs: knihovnou GDAL nebo OGR, GRASS je nutno zkompilovat s podporou GDAL a OGR.

source: The folder (Grass database) in which the location should be created
cs: Adres·¯ (GRASS database) v r·mci nÏhoæ je vytvo¯ena dan· location

source: Path to georeferenced file:
cs: Cesta ke georeferencovanÈmu souboru:

source: Georeferenced file with projection information that can be read
cs: Georeferencovan˝ soubor s informacemi o sou¯adnicovÈm systÈmu ËitelnÈ

source: by GDAL (raster) or OGR (vector)
cs: knihovnou GDAL (rastrov· vrstva) nebo OGR (vektorov· vrstva)

source: &File
cs: &Soubor

source: Raster map
cs: Rastrov· mapa

source: Multiple formats using GDAL
cs: R˘znorodÈ form·ty pomocÌ GDAL

source: Aggregate ASCII xyz data into raster grid
cs: Seskupit ASCII xyz data do rastovÈ m¯Ìæky

source: ASCII GRID (includes GRASS ASCII)
cs: ASCII GRID (vËetnÏ GRASS ASCII)

source: Polygons and lines from ASCII file
cs: Polygony a linie z ASCII souboru

source: Binary file (includes GTOPO30 format)
cs: Bin·rnÌ soubor (vËetnÏ form·tu GTOPO30)

source: GRIDATB.FOR map file (TOPMODEL)
cs: Mapov˝ soubor GRIDATB.FOR (TOPMODEL)

source: MAT-File (v.4) array (Matlab or Octave)
cs: Pole MAT-File (v.4) (Matlab nebo Octave)

source: SPOT vegetation NDVI data sets
cs: SPOT vegetaËnÌ NDVI datov˝ set

source: SRTM hgt files
cs: Soubory SRTM hgt

source: Terra ASTER HDF files
cs: Soubory Terra ASTER HDF

source: Web Mapping Server
cs: Webov˝ mapov˝ server

source: Vector map
cs: Vektorov· mapov· vrstva

source: Various formats using OGR
cs: R˘znÈ form·ty pomocÌ OGR

source: ASCII points file or GRASS ASCII vector file
cs: Bodov˝ soubor ASCII nebo vektorov˝ soubor GRASS ASCII

source: Import old GRASS vector format
cs: Importovat zastaral˝ vektorov˝ form·t GRASS

source: DXF file
cs: Soubor DXF

source: ESRI e00 format
cs: Form·t ESRI e00

source: Garmin GPS Waypoints/Routes/Tracks
cs: Garmin GPS trasovÈ body/cesty/stopy

source: GPS Waypoints/Routes/Tracks using GPSBabel
cs: GPS Waypoints/Routes/Tracks pomocÌ GPSBabel

source: GEOnet Name server country files (US-NGA GNS)
cs: Soubory GEOnet Name server (US-NGA GNS)

source: Matlab and MapGen files
cs: Soubory Matlab a MapGen

source: ASCII 3D file
cs: Soubor ASCII 3D

source: Vis5D file
cs: Soubor Vis5D

source: ASCII grid (for GRASS, Surfer, Modflow, etc)
cs: f¸r

source: ASCII x,y,z values of cell centers
cs: ASCII x,y,z hodnot st¯ed˘ bunÏk

source: Binary file
cs: Bin·rnÌ soubor

source: MPEG-1 animations
cs: Animace MPEG-1

source: PNG image (not georeferenced)
cs: Soubor PNG (bez georeference)

source: PPM image (24bit)
cs: Soubor PPM (24bit)

source: PPM image from red, green, blue raster maps
cs: Soubor PPM z RGB rastrovÈ vrstvy

source: TIFF image (8/24bit)
cs: Soubor TIFF (8/24bit)

source: VRML file
cs: Soubor VRML

source: VTK ASCII file
cs: Soubor VTK ASCII

source: Various formats using OGR (SHAPE, MapInfo etc)
cs: R˘znÈ form·ty podporovanÈ OGR (SHAPE, MapInfo, atd.)

source: DXF file (ASCII)
cs: Soubor DXF (ASCII)

source: ASCII vector or point file/old GRASS ASCII vector file
cs: ASCII vektorov˝ nebo bodov˝ soubor/star˝ vektorov˝ GRASS ASCII soubor

source: POV-Ray format
cs: Form·t POV-Ray

source: Manage maps and volumes
cs: Spr·va 2D & 3D (volumes) mapov˝ch vrstev

source: Copy maps
cs: KopÌrovat mapovÈ vrstvy

source: List maps
cs: Vypsat mapovÈ vrstvy

source: List maps using expressions and 'wildcards'
cs: Vypsat mapovÈ vrstvy na z·kladÏ regul·rnÌho v˝razu

source: Rename maps
cs: P¯ejmenovat mapovÈ vrstvy

source: Remove maps
cs: Odstranit mapovÈ vrstvy

source: Remove maps using expressions and 'wildcards'
cs: Odstranit mapovÈ vrstvy na z·kladÏ regul·rnÌho v˝razu

source: Map type conversions
cs: Konverze typu mapovÈ vrstvy

source: Raster to vector map
cs: Automatick· vektorizace rastrovÈ vrstvy

source: Raster map series to volume
cs: Konverze ¯ady rastrov˝ch vrstev na volume

source: Vector to raster
cs: Rasterizace vektorovÈ vrstvy

source: Vector to vector
cs: P¯evod vektorovÈ na vektorovou vrstvu

source: Vector lines to points
cs: P¯evod vektorov˝ch liniÌ na body

source: Vector 3D points to volume voxels
cs: Konverze 3D vektorovÈ bodovÈ vrstvy na volume voxels

source: Sites (GRASS 5.x) to vector
cs: Vytvo¯enÌ vektorovÈ vrstvy z bod˘ (sites, GRASS 5.x)

source: Volumes to raster map series
cs: P¯evod volume na ¯adu rastrov˝ch vrstev

source: &Config
cs: &Konfigurace

source: Display region settings
cs: Zobrazit nastavenÌ regionu

source: Change region settings
cs: ZmÏnit nastavenÌ regionu

source: Zoom to maximum extent of all displayed maps
cs: ZvÏtπit na maxim·lnÌ v˝¯ez pokr˝vajÌcÌ vπechny zobrazenÈ mapovÈ vrstvy

source: GRASS working environment
cs: PracovnÌ prost¯ednÌ GRASSu

source: Access other mapsets in current location
cs: P¯Ìstupov· pr·va k jin˝m mapset˘m v aktu·lnÌ location

source: Change current working session to new mapset, location, or GISDBASE
cs: ZmÏnit aktu·lnÌ sezenÌ na nov˝ mapset, location nebo GISDBASE

source: Modify access by other users to current mapset
cs: Upravit p¯Ìstupov· pr·va ostatnÌm uæivatel˘m aktu·lnÌ mapsetu

source: Show current GRASS environment settings
cs: Zobrazit aktu·lnÌ nastavenÌ prost¯edÌ GRASSu

source: Set GRASS environment settings
cs: Nastavit prost¯edÌ GRASSu

source: Show current GRASS version
cs: Zobrazit aktu·lnÌ verzi GRASSu

source: Manage projections
cs: Spr·va kartografick˝ch zobrazenÌ

source: Create/edit projection information for current location
cs: Vytvo¯it/modifikovat informace o kartografickÈ zobrazenÌ aktu·lnÌ lokace

source: Show projection information and create projection files
cs: Zobrazit informace o kartografickÈm zobrazenÌ a vytvo¯it souvisejÌcÌ soubory

source: Convert coordinates from one projection to another
cs: Transformovat sou¯adnice z jednoho sou¯adnicovÈho systÈmu do druhÈho

source: Select default text font
cs: Vybrat v˝chozÌ pÌsmo textu

source: Select default freetype text font
cs: Vybrat v˝chozÌ pÌsmo freetype textu

source: X-monitor displays
cs: ZobrazovacÌ jednotka X-monitor

source: Configure xmonitor displays
cs: Konfigurovat zobrazovacÌ jednotku xmonitor

source: Configure frames for xmonitors
cs: Konfigurovat r·mce pro xmonitors

source: Start/restart xmonitor at specified window size
cs: Otev¯Ìt/restartovat xmonitor o specifikovanÈ velikosti okna

source: Set active xmonitor to specified size
cs: Nastavit aktivnÌ xmonitor na specifikovanou velikost

source: Display information about active xmonitor
cs: Zobrazit informace o aktivnÌm xmonitoru

source: &Raster
cs: &Rastr

source: Develop map
cs: Tvorba mapov˝ch vrstev

source: Digitize raster
cs: Vektorizovat rastrovou vrstvu

source: Compress/decompress raster file
cs: Komprimovat/dekomprimovat rastrov˝ soubor

source: Manage boundary definitions
cs: Spr·va definic hranic

source: Manage null values
cs: Spr·va pr·zdn˝ch hodnot

source: Manage timestamps for files
cs: Spr·va Ëasov˝ch znaËek pro soubory

source: Quantization for floating-point maps
cs: Kvantizace mapov˝ch vrstev s plovoucÌ desetinnou Ë·rkou

source: Resample (change resolution)
cs: P¯evzorkov·nÌ (zmÏna rozliπenÌ)

source: Resample using nearest neighbor method
cs: P¯evzorkov·nÌ (zmÏna rozliπenÌ) metodou nejbliæπÌho souseda

source: Resample using various interpolation methods
cs: P¯evzorkov·nÌ (zmÏna rozliπenÌ) za pouæitÌ r˘zn˝ch metod

source: Resample using aggregate statistics
cs: P¯ezvorkov·nÌ za pouæitÌ agregaËnÌch statik

source: Resample using regularized spline with tension method
cs: P¯evzorkov·nÌ (zmÏna rozliπenÌ) pomocÌ RST (regularized spline tension)

source: Support file creation and maintenance
cs: Vytvo¯enÌ a spr·va podp˘rnÈho souboru

source: Reproject raster from other location
cs: Transformovat rastrovou vrstvy z jinÈ location

source: Generate tiling for other projection
cs: Vytvo¯ dlaæidice pro jinou projekci

source: Manage map colors
cs: Spr·va barevnÈ πk·ly mapov˝ch vrstev

source: Set colors to predefined color tables
cs: Nastavit barevnou πk·lu podle p¯edefinovanÈ tabulky barev

source: Set colors using color rules
cs: Nastavit barevnou πk·lu podle pravidel

source: Blend 2 color maps to produce 3 RGB files
cs: Spojit 2 barevnÈ mapovÈ vrstvy a vytvo¯it 3 soubory RGB

source: Create color image from RGB files
cs: Vytvo¯it barevn˝ obraz ze soubor˘ RGB

source: Create 3 RGB (red, green, blue) maps from 3 HIS (hue, intensity, saturation) maps
cs: Vytvo¯it 3 mapovÈ vrstvy RGB (red, green, blue) ze 3 vrstev HIS (hue, intensity, saturation)

source: Query by coordinate(s)
cs: Sou¯adnicov˝ dotaz

source: Create raster buffers
cs: Vytvo¯it rastrovou obalovou zÛnu

source: Create raster MASK
cs: Vytvo¯it rastrovou masku (MASK)

source: Locate closest points between areas in 2 raster maps
cs: Lokalizovat nejbliæπÌ body mezi plochami ve 2 rastrov˝ch vrstv·ch

source: Map calculator
cs: Mapov˝ kalkul·tor

source: Neighborhood analysis
cs: Anal˝za okolÌ

source: Moving window analysis of raster cells
cs: Lok·lnÌ filtrov·nÌ obrazu (pohybujÌcÌ se okno)

source: Analyze vector points in neighborhood of raster cells
cs: Analyzovat vektorovÈ body v okolÌ rastrov˝ch bunÏk

source: Overlay maps
cs: P¯ekrytÌ mapov˝ch vrstev

source: Cross product
cs: V˝sledek p¯eloæenÌ

source: Function of map series (time series)
cs: Funkce ¯ady mapov˝ch vrstev (Ëasov· ¯ada)

source: Patch maps
cs: Spojit mapovÈ vrstvy

source: Statistical calculations for cover map over base map
cs: SestavenÌ statistiky krycÌ a podkladovÈ mapovÈ vrstvy

source: Solar radiance and shadows
cs: Sol·rnÌ z·¯enÌ a stÌny

source: Solar irradiance and daily irradiation
cs: Sol·rnÌ dennÌ intenzita z·¯enÌ

source: Shadows map for sun position or date/time
cs: StÌnov· mapov· vrstva pro danou pozici slunce nebo datum/Ëas

source: Terrain analysis
cs: TerennÌ anal˝za

source: Calculate cumulative movement costs between locales
cs: V˝poËet kumulativnÌho pohyby n·klad˘ mezi lokacemi

source: Cost surface
cs: Povrch n·klad˘

source: Least cost route or flow
cs: NejmÈnÏ n·kladn· cesta nebo dr·ha odtoku

source: Profile analysis
cs: Anal˝za profilu

source: Shaded relief map
cs: Mapa stÌnovanÈho reliefu

source: Slope and aspect
cs: MÌra svahu a expozice

source: Terrain parameters
cs: Parametry terÈnu

source: Textural features
cs: Textur·lnÌ prvky

source: Visibility/line of sight
cs: Viditelnost/linie viditelnosti

source: Transform features
cs: Prvky transformace

source: Clump small areas (statistics calculated by r.volume)
cs: Nahromadit malÈ plochy (statistika vytvo¯ena pomocÌ r.volume)

source: Grow areas
cs: ZvÏtπit plochy

source: Thin linear features
cs: ZtenËit liniovÈ prvky

source: Hydrologic modeling
cs: HydrologickÈ modelov·nÌ

source: Carve stream channels into elevation map using vector streams map
cs: Zaznamenat trasu toku do v˝πkovÈho modelu pomocÌ vektorovÈ vrstvy toku

source: Depressionless elevation map and flowline map
cs: Mape elevace zbaven· depresÌ a mapa drah povrchovÈho odtoku

source: Fill lake from seed point to specified level
cs: Vyplnit jezero ze zvolenÈho bodu na specifikovanou hladinu

source: Flow accumulation for massive grids
cs: Akumulace toku gridu

source: Generate flow lines for raster map
cs: Vytvo¯it rozvodnice pro rastrovou vrstvu

source: SIMWE overland flow modeling
cs: Modelov·nÌ povrchovÈho odtoku SIMWE

source: SIMWE sediment erosion, transport, & deposition modeling
cs: Modelov·nÌ SIMWE eroze, transport & deponov·nÌ

source: Topographic index map
cs: Mapa s topografick˝m indexem

source: TOPMODEL simulation
cs: Simulace TOPMODEL

source: Watershed subbasins
cs: Rozvodnice subpovodÌ

source: Watershed analysis
cs: Anal˝za povodÌ

source: Watershed basin creation
cs: Vytvo¯enÌ rozvodnice povodÌ

source: Landscape structure modeling
cs: Modelov·nÌ struktury krajiny

source: Set up sampling and analysis framework
cs: Nastavit vzorkov·nÌ a anal˝zu r·mce

source: Analyze landscape characteristics
cs: Anal˝za charakteristik krajiny

source: Analyze landscape patch characteristics
cs: Anal˝za krajin˝ch "patch" charakteristik

source: Output landscape patch information
cs: V˝stupnÌ krajinn· "patch" informace

source: Wildfire modeling
cs: Modelov·nÌ poæ·ru

source: Generate rate of spread (ROS) maps
cs: Vytvo¯it mapovou vrstvu rychlosti πÌ¯enÌ (ROS)

source: Generate least-cost spread paths
cs: Vytvo¯it trasy s nejmenπÌm odporem πÌ¯enÌ

source: Simulate anisotropic spread phenomena
cs: Simulovat anisotropick˝ jev πÌ¯enÌ

source: Change category values and labels
cs: Modifikovat hodnoty kategoriÌ a πtÌtky

source: Edit category values of individual cells for displayed raster map
cs: Editovat hodnoty kategoriÌ individu·lnÌch bunÏk zobrazenÈ rastrovÈ vrstvy

source: Reclassify categories for areas of specified sizes
cs: Reklasifikovat kategorie ploch o specifikovanÈ velikosti

source: Reclassify categories using rules
cs: Reklasifikovat kategorie na z·kladÏ pravidel

source: Reclassify categories using rules file
cs: Reklasifikovat kategorie na z·kladÏ souboru s pravidly

source: Recode categories using rules (create new map)
cs: P¯ekÛdovat kategorie na z·kladÏ pravidel (vytvo¯it novou mapu)

source: Recode categories using rules file (create new map)
cs: P¯ekÛdovat kategorie na z·kladÏ souboru s pravidly (vytvo¯it novou mapu)

source: Rescale categories (create new map)
cs: Upravit rozsah kategoriÌ (vytvo¯it novou mapovou vrstvu)

source: Rescale categories with equalized histogram (create new map)
cs: Upravit rozsah kategoriÌ vËetnÏ ekvalizovanÈho histogramu (vytvo¯it novou mapovou vrstvu)

source: Generate concentric circles around points
cs: Vytvo¯it soust¯ednÈ kruhy z dan˝ch bod˘

source: Generate random raster cells
cs: Vytvo¯it rastrovou vrstvu s n·hodn˝mi hodnotami

source: Generate random cells
cs: Vytvo¯it rastrovou vrstvu s n·hodn˝mi hodnotami

source: Generate random cells and vector points from raster map
cs: Vytvo¯it rastrovou vrstvu a vektorovÈ body s n·hodn˝mi hodnotami

source: Generate surfaces
cs: Vytvo¯it povrch

source: Generate density surface using moving Gausian kernal
cs: Vytvo¯ povrch s hustotou za pouæitÌ pohyblivÈho Gaussova okna

source: Generate fractal surface
cs: Vytvo¯it povrch na z·kladÏ frakt·lu

source: Generate gaussian deviates surface
cs: Vytvo¯ povrch Gaussov˝ch odchylek

source: Generate plane
cs: Vytvo¯it rovinn˝ povrch

source: Generate random deviates surface
cs: Vytvo¯ n·hodn˝ povrch

source: Generate random surface with spatial dependence
cs: Vytvo¯it n·hodn˝ povrch s prostorov˝m vztahem

source: Generate vector contour lines
cs: Vytvo¯it vektorovÈ vrstevnice

source: Interpolate surfaces
cs: Interpolovat povrch

source: Bilinear interpolation from raster points
cs: Biline·rnÌ interpolace z rastrov˝ch bunÏk

source: Inverse distance weighted interpolation from raster points
cs: Interpolace IDW (inverse distance weighted) rastrov˝ch bod˘

source: Interpolation from raster contours
cs: Interpolace z rastrov˝ch vrstevnic

source: Inverse distance weighted interpolation from vector points
cs: Interpolace IDW (inverse distance weighted) vektorov˝ch bod˘

source: Regularized spline tension interpolation from vector points or contours
cs: Interpolace RST (regularized spline tension) vektorov˝ch bod˘ nebo vrstevnic

source: Fill NULL cells by interpolation using regularized spline tension
cs: Vyplnit buÚky s pr·zdnou hodnotou vyuæitÌm interpolace RST (regularized spline tension)

source: Reports and statistics
cs: Zpr·vy a statistiky

source: Report basic file information
cs: Vypsat z·kladnÌ informace o souboru

source: Report category labels and values
cs: Vypsat popisky a hodnoty kategorii

source: General statistics
cs: Z·kladnÌ statistiky

source: Range of all category values
cs: Rozsah hodnot kategorii

source: Sum all cell category values
cs: SouËet vπech hodnot kategoriÌ bunÏk

source: Sum area by map and category
cs: Suma v˝mÏry ploch podle kategoriÌ a v mapÏ

source: Summary statistics for clumped cells (works with r.clump)
cs: Souhrnn· statistika spojen˝ch bunÏk (po pouæitÌ r.clump)

source: Total surface area corrected for topography
cs: Celkov· plocha povrchu s topografickou korekcÌ

source: Univariate statistics
cs: UnivariatnÌ statistika

source: Univariate statistics (script version)
cs: UnivariatnÌ statistika (skriptov· verze)

source: Sample values along transects
cs: KontrolnÌ hodnoty profilu

source: Sample values along transects (use azimuth, distance)
cs: KontrolnÌ hdonoty profilu (pouæÌt azimut, vzd·lenost)

source: Covariance/correlation
cs: Kovariance/korelace

source: Linear regression between 2 maps
cs: Line·rnÌ regrese mezi 2 mapov˝mi vrstvami

source: Mutual category occurences (coincidence)
cs: SpoleËn˝ v˝skyt kategorie (koincidence)

source: &Vector
cs: &Vectorov· vrstva

source: Digitize
cs: Digitalizace

source: Create/rebuild topology
cs: Vytvo¯it/znovu sestavit topologii

source: Clean vector files
cs: VyËistit vektorovÈ soubory

source: Add missing centroids
cs: P¯idat chybÏjÌcÌ centroidy

source: Build polylines from adjacent segments
cs: Sestavit polygony ze sousednÌch segment˘

source: Split polylines into segments
cs: RozdÏlit polygony na segmenty

source: Create lines parallel to existing lines
cs: Vytvo¯it linie rovnobÏænÈ s existujÌcÌ liniÌ

source: Dissolve common boundaries
cs: RozloæÌ spoleËnÈ hranice

source: Convert vector feature types
cs: Konvertovat typy vektorov˝ch prvk˘

source: Convert 2D vector to 3D by sampling raster
cs: Konvertovat 2D vektorovou vrstvu na 3D pomocÌ vzorkov·nÌ rastru

source: Extrude 2D vector into 3D vector
cs: Vytvo¯it 3D vektorov˝ objekt na z·kladÏ 2D vektorovÈho obrysu

source: Create text label file for vector features
cs: Vytvo¯it textov˝ popisek pro vektorovÈ prvky

source: Reproject vector from other location
cs: Transformovat vektorovou vrstvu z jinÈ lokace

source: Vector<->database connections
cs: SpojenÌ vektorov· vrstva<->datab·ze

source: Create new vector as link to external OGR layer
cs: Vytvo¯it novou vektorovou vrstvu jako link na externÌ vrstvu OGR

source: Set database connection for vector attributes
cs: Nastavit datab·zovÈ spojenÌ pro vektorovÈ atributy

source: Rectify and georeference vector map
cs: Rektifikovat a georeferencovat vektorovou vrstvu

source: Query by attributes
cs: Atributov˝ dotaz

source: Query by map features
cs: Dotaz na prvky mapovÈ vrstvy

source: Create vector buffers
cs: Vytvo¯it vektorovou obalovou zÛnu

source: Linear referencing for vectors
cs: Line·rnÌ referencov·nÌ pro vektorovÈ vrstvy

source: Create linear reference system
cs: Vytvo¯it line·rnÌ referenËnÌ systÈm

source: Create stationing from imput lines, and linear reference system
cs: Vytvo¯it staniËenÌ ze vstupnÌch liniÌ a line·rnÌ referenËnÌ systÈm

source: Create points/segments from input lines, linear reference system and positions read from stdin
cs: Vytvo¯it body/segmenty ze vstupnÌch liniÌ, line·rnÌ referenËnÌ systÈm a pozice naËtenÈ ze standardnÌho vstupu (stdin)

source: Find line id and real km+offset for given points in vector map using linear reference system
cs: NalÈzt id linie a skuteËnÈ km+odsazenÌ pro danÈ body ve vektorovÈ vrstvÏ s vyuæitÌm lini·rnÌho referenËnÌho systÈmu

source: Locate nearest features to points or centroids
cs: Lokalizovat nejbliæπÌ prvky od danÈho bodu Ëi centroidu

source: Generate Thiessen polygons around points (Voronoi diagram)
cs: Vytvo¯it Thuessenovy polygony v bodovÈ vrstvÏ (Voronoi diagram)

source: Connect points to create Delaunay triangles
cs: Spojit body a vytvo¯it Delaunayovu triangulaËnÌ sÌª

source: Network analysis
cs: SÌªov· anal˝za

source: Allocate subnets
cs: Alokovat podsÌtÏ

source: Network maintenance
cs: Spr·va sÌtÏ

source: Shortest route
cs: NejkratπÌ cesta
