Repository: OSGeo/grass-legacy
Catalog: locale/po/grasstcl_*.po
Languages: cs

source: Shortest route (visualization only)
cs: NejkratπÌ cesta (pouze vizualizace)

source: Split net to bands between cost isolines
cs: RozdÏlit sÌª do skupin mezi izoliniemi n·klad˘

source: Steiner tree
cs: Steiner˘v strom

source: Traveling salesman analysis
cs: ProblÈm obchodnÌho cestujÌcÌho

source: Overlay/combine 2 vector maps
cs: P¯ekr˝t/kombinovat 2 vektorovÈ vrstvy

source: Patch multiple maps (combine)
cs: Spojit r˘znÈ mapovÈ vrstvy (kombinace)

source: Generate area feature for extent of current region
cs: Vytvo¯it plochu pokr˝vajÌcÌ aktu·lnÌ region

source: Generate rectangular vector grid
cs: Vytvo¯it pravo˙hlou vektorovou m¯Ìæku

source: Change attributes
cs: ZmÏnit atributy

source: Attach, delete, or report categories
cs: P¯ipojit, odstranit a vypsat kategorie

source: Reclassify features using rules file
cs: Reklasifikovat prvky na z·kladÏ souboru s pravidly

source: Work with vector points
cs: Pracovat s vektorov˝mi body

source: Generate points
cs: Vytvo¯it bodovou vrstvu

source: Generate points from database with x/y coordinates
cs: Vytvo¯it bodovou vrstvu na z·kladÏ sou¯adnic x/y uloæen˝ch v datab·zi

source: Generate random points
cs: Vytvo¯it n·hodnou bodovou vrstvu

source: Random location perturbations of points
cs: N·hodn· lok·lnÌ pertubace bod˘

source: Generate areas from points
cs: Vytvo¯it plochy z bodov˝ch dat

source: Generate convex hull for point set
cs: Vytvo¯it konvexnÌ ob·lku bodovÈ vrstvy

source: Generate Delaunay triangles for point set
cs: Vytvo¯it Delaunayovu triangulaËnÌ sÌª bodovÈ vrstvy

source: Generate Voronoi diagram/Thiessen polygons for point set
cs: Vytvo¯it Voronoi diagram/Thiessenovy polygony bodovÈ vrstvy

source: Sample raster maps
cs: Vzorkovat rastrovÈ vrstvy

source: Calculate statistics for raster map overlain by vector map
cs: Sestavit statistiku rastrovÈ vrstvy p¯ekrytÈ vektorovou vrstvou

source: Sample raster map at point locations
cs: Vzorkovat rastrovou vrstvu z danÈho bodu

source: Sample raster neighborhood around points
cs: Vzorkovat okolÌ v rastrovÈ vrstvÏ v okolÌ danÈho bodu

source: Partition points into test/training sets for k-fold cross validatation
cs: Body do testovacÌch/trÈningov˝ch soubor˘ pro k-fold validaci

source: Transfer attribute data from queried vector map to points
cs: P¯evÈst atributov· data z dotazovanÈ vektorovÈ vrstvy na body

source: Basic information
cs: Z·kladnÌ informace

source: Load vector attributes to database or create reports
cs: NaËÌst vektorovÈ atributy do datab·ze nebo vytvo¯it zpr·vu

source: Report areas for vector attribute categories
cs: Zpr·va o ploch·ch pro kategorie atribut˘

source: Test normality of point distribution
cs: Test normality rozloæenÌ bod˘

source: Calculate stats for raster map underlying vector objects
cs: Sestavit statistiku pro rastrovou vrstvu p¯ekr˝vajÌcÌ vektorovÈ objekty

source: Indices of point counts in quadrats
cs: Seznamy poËtu bod˘ v kvadrantech

source: &Image
cs: &Obrazov˝ soubor

source: Develop images and groups
cs: Vytvo¯it obrazov˝ soubor a skupiny

source: Create/edit imagery group
cs: Vytvo¯it/modifikovat obrazovou skupinu

source: Target imagery group
cs: CÌlov· obrazov· skupina

source: Mosaic up to 4 adjacent images
cs: Vytvo¯it mozaiku vÌce jak 4 sousednÌ obrazovÈ soubory

source: Manage image colors
cs: Sprava barevnÈ πk·ly obrazov˝ch dat

source: Color balance and enhance color tables of multiband imagery for rgb display
cs: Zv˝raznÏnÌ a vyrovn·nÌ barev tabulky barev pro multikan·lov· obrazov· data

source: Transform HIS (Hue/Intensity/Saturation) color image to RGB (Red/Green/Blue)
cs: P¯evÈst obrazov˝ soubor z HIS (Hue/Intensity/Saturation) na RGB (Red/Green/Blue)

source: Transform RGB (Red/Green/Blue) color image to HIS (Hue/Intensity/Saturation)
cs: P¯evÈst obrazov˝ soubor z RGB (Red/Green/Blue) na HIS (Hue/Intensity/Saturation)

source: Rectify and georeference image group
cs: Rektifikovat a georeferencovat obrazovou skupinu

source: Set ground control points (GCP's) from raster map or keyboard entry
cs: OznaËit vlÌcovacÌ body (ground control points - GCP) na podkladovÈ rastrovÈ vrstvÏ nebo pomocÌ kl·vesnice

source: Set ground control points (GCP's) from vector map or keyboard entry
cs: OznaËit vlÌcovacÌ body (ground control points - GCP) na podkladovÈ vektorovÈ vrstvÏ nebo pomocÌ kl·vesnice

source: Affine and Polynomial rectification (rubber sheet)
cs: AfinnÌ a polynomnÌ rektifikace

source: Ortho photo rectification
cs: Ortofoto rektifikace

source: Brovey transformation and pan sharpening
cs: Broveyova transformace a ost¯enÌ

source: Classify image
cs: Klasifikace obrazov˝ch dat

source: Clustering input for unsupervised classification
cs: Metoda shlukov·nÌ pro ne¯Ìzenou klasifikaci

source: Maximum likelyhood classification (MLC)
cs: Gauss˘v klasifik·tor MLC (Maximum likelihood classification)

source: Sequential maximum a posteriory classification (SMAP)
cs: Klasifik·tor SMAP (Sequential maximum a posteriory)

source: Interactive input for supervised classification
cs: InterativnÌ vstup pro ¯Ìzenou klasifikaci

source: Non-interactive input for supervised classification (MLC)
cs: NeinteraktivnÌ vstup pro ¯Ìzenou klasifikaci (MLC)

source: Non-interactive input for supervised classification (SMAP)
cs: NeinteraktivnÌ vstup pro ¯Ìzenou klasifikaci (SMAP)

source: Filter image
cs: Filrace obrazu

source: Zero edge crossing detection
cs: Detekce hran (zero edge crossing)

source: User defined matrix/convolving filter
cs: Uæivatelsk· definice maticovÈho filtru

source: Spectral response
cs: Spektr·lnÌ odezva

source: Tassled cap vegetation index
cs: VegetaËnÌ index (tassled cap)

source: Transform image
cs: Transformace obrazu

source: Canonical component
cs: KanonickÈ komponenty

source: Principal component
cs: HlavnÌ komponenty

source: Fast Fourier Transform
cs: Fourierova transformace

source: Inverse Fast Fourier Transform
cs: InverznÌ Fourierova transformace

source: Range of image values
cs: Rozsah obrazov˝ch hodnot

source: Bit pattern comparison for ID of low quality pixels
cs: Korelace (bit pattern comparsion) pro ID pixel˘ s nÌzkou kvalitou

source: Kappa classification accuracy assessment
cs: UrËenÌ p¯esnosti kappa klasifikace

source: Optimum index factor for LandSat TM
cs: Faktor optim·lnÌho indexu pro LandSat TM

source: &Grid3D
cs: 3D &Grid

source: Develop grid3D volumes
cs: Vytvo¯it grid3D volumes

source: Manage nulls for grid3D volume
cs: Spr·va pr·zdn˝ch hodnot pro grid3D volume

source: Manage timestamp for grid3D volume
cs: Spr·va Ëasov˝ch znaËek pro grid3D volume

source: Create 3D mask for grid3D operations
cs: Vytvo¯it 3D masku (mask) pro operace na grid3D

source: Create 2D raster cross section from grid3d volume
cs: Vytvo¯Ì 2D rastrovou mapu protnutÌ 3D-rastrov˝ch objem˘

source: Map calculator for grid3D operations
cs: Mapov˝ kalkul·tor pro operace grid3D

source: Interpolate volume from vector points using splines
cs: Interpolovat volume z vektorov˝ch bod˘ pomocÌ RST (splines)

source: Report and Statistics
cs: V˝pis a statistiky

source: Display information about grid3D volume
cs: Zobrazit informace o grid3D volume

source: &Databases
cs: &Datab·ze

source: Manage database
cs: Spr·va datab·ze

source: Connect to database
cs: SpojenÌ s datab·zÌ

source: Login to database
cs: P¯ihl·πenÌ do datab·ze

source: Copy table
cs: KopÌrovat tabulku

source: Add columns to table
cs: P¯idat sloupec do tabulky

source: Change values in a column
cs: ZmÏnit hodnoty ve sloupci

source: Test database
cs: Test spojenÌ s datab·zÌ

source: Database information
cs: Informace o datab·zi

source: Describe table
cs: Popsat tabulku

source: List columns
cs: Seznam sloupc˘

source: List drivers
cs: Seznam ovladaË˘

source: List tables
cs: Seznam tabulek

source: Query
cs: Dotaz

source: Query data (SQL select)
cs: Datov˝ dotaz (SQL select)

source: Execute SQL statement
cs: Vykonat SQL p¯Ìkaz

source: Command:
cs: P¯Ìkaz:

source: Labels name:
cs: N·zev popisk˘:

source: Display constraints:
cs: Zobrazit omezenÌ:

source: region size
cs: velikost regionu

source: ignore rotation setting and draw horizontally
cs: ignorovat nastavenÈ otoËenÌ a vykreslit vodorovnÏ

source: dxf file
cs: soubor dxf

source: Garmin GPS Waypoints/Routes/Tracks using GPSBabel
cs: Garmin GPS Waypoints/Routes/Tracks pomocÌ GPSBabel

source: Groups
cs: Skupiny

source: New
cs: Nov˝

source: Create new group file
cs: Vytvo¯it novou skupinu soubor˘

source: Open...
cs: Otev¯Ìt...

source: Open group file
cs: Otev¯Ìt skupinu soubor˘

source: Save
cs: Uloæit

source: Save group file
cs: Uloæit skupinu soubor˘

source: Save as...
cs: Uloæit jako...

source: Save group file as name
cs: Uloæit skupinu soubor˘ jako n·zev

source: Close group
cs: Uzav¯Ìt skupinu

source: Save display to image file
cs: Uloæit zobrazenÌ do obrazovÈho souboru

source: XWD (Save display, selected with mouse, to map.xwd in home directory )
cs: XWD (Uloæit zobrazenÌ, vybranÈ pomocÌ myπi, do map.xwd umÌstÏnÈho v domovskÈm adres·¯i)

source: Save displays to multiple graphic file formats
cs: Uloæit zobrazenÌ do rozmanit˝ch grafick˝ch form·t˘

source: Save map to Postscript file
cs: Uloæit mapu do souboru Postscript

source: Print to default printer
cs: Tisknout na v˝chozÌ tisk·rnÏ

source: print
cs: tisknout

source: E&xit
cs: &Konec

source: Exit Display Manager
cs: UkonËit Display Manager

source: Resample (change resolution) using nearest neighbor method
cs: P¯evzorkov·nÌ (zmÏna rozliπenÌ) metodou nejbliæπÌho souseda

source: Resample (change resolution) using regularized spline tension
cs: P¯evzorkov·nÌ (zmÏna rozliπenÌ) pomocÌ RST (regularized spline tension)

source: &Help
cs: &N·povÏda

source: GRASS help
cs: N·povÏda GRASSu

source: GIS Manager &help
cs: &N·povÏda GIS Manageru

source: GIS Manager help
cs: N·povÏda GIS Manageru

source: About &GRASS
cs: O &GRASSu

source: About GRASS
cs: O GRASSu

source: About &System
cs: O &systÈmu

source: About System
cs: O systÈmu

source: Paper format
cs: Form·t papÌru

source: Custom
cs: Uæivatelsk˝

source: width:
cs: πÌ¯ka:

source: height:
cs: v˝πka:

source: left:
cs: lev˝:

source: right:
cs: prav˝:

source: top:
cs: hornÌ:

source: bottom:
cs: dolnÌ:

source: PS file:
cs: Soubor PS

source: Browse
cs: Proch·zet

source: PDF file:
cs: Soubor PDF:

source: PNG file:
cs: Soubor PNG:

source: PNG file resolution (points/inch):
cs: RozliπenÌ souboru PNG (body/inch):

source: Printer:
cs: Tisk·rna:

source: Script file:
cs: Skript:

source: Print
cs: Tisk

source: Preview
cs: N·hled

source: Raster name:
cs: JmÈno rastrovÈho souboru:

source: show legend in selected display monitor
cs: zobrazit legendu ve vybranÈm grafickÈm monitoru

source: thin legend by
cs: ztenËit legendu pomocÌ

source: Raster to drape over 1st map:
cs: Rastrov· mapa p¯ekr˝vajÌ prvnÌ mapu:

source: show legend for drape map in monitor
cs: zobrazit legendu pro p¯ekr˝vajÌcÌ mapu v monitoru

source: overlay maps from other layers (transparent null value cells)
cs: p¯ekr˝vajÌcÌ se mapy z ostatnÌch vrstev (transparentnÌ jsou buÚky s pr·zdnou hodnotou)

source: Display active layers in current region
cs: Zobrazit aktivnÌ vrstvy v aktu·lnÌ regionu

source: Display active layers in default region
cs: Zobrazit aktivnÌ vrstvy ve v˝chozÌm regionu

source: Display active layers in saved region setting
cs: Zobrazit aktivnÌ vrstvy v uloæenÈm regionu

source: Erase to white
cs: Smazat obsah s v˝chozÌ barvou bÌlou

source: NVIZ - n dimensional visualization
cs: NVIZ - n dimenzion·lnÌ vizualizace

source: Fly through path for NVIZ
cs: Let trasou pro NVIZ

source: Animate raster map series
cs: Animovat serii rastrov˝ch map

source: Zoom
cs: Transfokace

source: Return to previous zoom
cs: Vr·tit na p¯edchozÌ zvÏtπenÌ

source: Pan and recenter
cs: T·hnout a vycentrovat

source: Query map (select map first)
cs: Mapa pro dotaz (nejprve vyberte mapu)

source: Measure lengths and areas
cs: MÏ¯it vzd·lenosti a plochy

source: Geographical position
cs: ZemÏpisn· pozice

source: Create new workspace file (erase current workspace settings first)
cs: Vytvo¯it nov˝ soubor s pracovnÌ oblastÌ (smaæe aktu·lnÌ nastavenÌ pracovnÌ oblasti)

source: Open existing workspace file
cs: Otev¯Ìt existujÌcÌ soubor s pracovnÌ oblastÌ

source: Save workspace file
cs: Uloæit soubor s pracovnÌ oblastÌ

source: Print raster & vector maps using ps.map
cs: Tisknout rastrovÈ & vektorovÈ mapovÈ vrstvy pomocÌ ps.map

source: Add raster layer
cs: P¯idat rastrovou vrstvu

source: Add RGB or HIS layer
cs: P¯idat RGB nebo HIS vrstvu

source: Add legend
cs: P¯idat legendu

source: Add vector layer
cs: P¯idat vektorovou vrstvu

source: Add thematic charts layer
cs: P¯idat tÈmatickou vrstvu

source: Add thematic map layer
cs: P¯idat tÈmatickou mapovou vrstvu

source: Add paint labels layer (from directory paint/labels)
cs: P¯idat vrstvu s popisky (z adres·¯e paint/labels)

source: Add freetype text layer
cs: P¯idat vrstvu s textem freetype

source: Add text layer
cs: P¯idat vrstvu s textem

source: Scalebar and north arrow
cs: MÏ¯Ìtko a smÏrov· r˘æice

source: Overlay grids and lines
cs: P¯ekr˝t m¯Ìæku a linie

source: Create or select display frame
cs: Vytvo¯it nebo vybrat r·mec

source: Add command layer
cs: P¯idat vrstvu s p¯Ìkazem

source: Add group
cs: P¯idat skupinu

source: Duplicate Layer
cs: Duplikovat vrstvu

source: Delete layer
cs: Odstranit vrstvu

source: Digitize map (select or create new map first)
cs: Digitalizovat mapu (vybrat nebo vytvo¯it nejprve novou mapu)

source: Vector name:
cs: N·zev vektorovÈ vrstvy:

source: Display:
cs: Zobrazit:

source: shapes
cs: tvary

source: categories
cs: kategorie

source: topology
cs: topologie

source: line directions
cs: smÏr liniÌ

source: points
cs: body

source: lines
cs: linie

source: boundaries
cs: hraniËnÌ linie

source: centroids
cs: centroidy

source: areas
cs: plochy

source: faces
cs: stÏna

source: icon
cs: ikona

source: Draw lines:
cs: Vykreslit linie:

source: color
cs: barva

source: Fill areas:
cs: Vyplnit plochy:

source: random colors
cs: n·hodnÈ barvy

source: GRASSRGB column colors
cs: sloupec GRASSRGB s barvami

source: Label vectors:
cs: Popisek vektorov˝ch vrstev:

source: label
cs: popisek

source: size
cs: velikost

source: text size
cs: velikost textu

source: align with pt
cs: zarovnanÌ [pt]

source: layer for labels
cs: vrstva pro popisky

source: attribute col for labels
cs: atributov˝ sloupec s popisky

source: Query vectors:
cs: Dotazovat vektorovÈ vrstvy:

source: layer for query
cs: vrstva pro dotazov·nÌ

source: query cat values
cs: dotazovat hodnoty kategoriÌ

source: SQL query
cs: Dotaz SQL

source: SQL where statement
cs: p¯Ìkaz SQL where

source: show attribute columns
cs: zobrazit atributovÈ sloupce

source: columns
cs: sloupce

source: Show columns
cs: Zobrazit sloupce

source: show data
cs: zobrazit data

source: Show data
cs: Zobrazit data

source: Mouse query setup:
cs: NastavenÌ dotazu myπÌ

source: edit attributes (form mode)
cs: editovat atributy (mÛd formul·¯e)

source: results as text in terminal
cs: v˝sledky jako text v termin·lu

source: Display when avg. region dimension is
cs: Zobrazit pokud je pr˘mÏrn˝ rozmÏr regionu

source: Line width for ps.map print output:
cs: ©Ì¯ka linie pro mapov˝ v˝stup ps.map:

source: Line width used for printing
cs: ©Ì¯ka linie pouæit· p¯i tisku

source: Text color:
cs: Barva textu:

source: Background color:
cs: Barva pozadÌ:

source: no background color
cs: barva pozadÌ nenastavena

source: display N. arrow only
cs: zobrazit pouze smÏrovou r˘æici

source: display scale only
cs: zobrazit pouze mÏ¯Ìtko

source: line scale instead of bar scale
cs: liniovÈ namÌsto prouækovÈho mÏ¯Ìtka

source: text on top of scale, instead of to right
cs: text umÌstit nad mÏ¯Ìtkem, namÌsto umÌstÏnÌ vpravo

source: use feet/miles instead of meters
cs: pouæÌt stopy/mÌle namÌsto metr˘

source: place with mouse (cannot save placement with group)
cs: umÌstit pomocÌ myπi (nelze uloæit umÌstÏnÌ v souvislosti se skupinou)

source: Vector map to chart:
cs: Vektorov· mapov· vrstva do grafu:

source: Vector type:
cs: Vektorov˝ typ:

source: show attribute columns
cs: zobrazit atributovÈ sloupce

source: Chart type:
cs: Typ grafu:

source: chart outline color:
cs: barva obrysu grafu

source: Text options: color
cs: Volby textu: barva

source: bold text
cs: tuËn˝ text

source: create and select frame
cs: vytvo¯it a vybrat r·mec

source: select frame
cs: vybrat r·mec

source: remove all frames
cs: odstranit vπechny r·mce

source: (leave blank to place with mouse; position will not save)
cs: (ponechte pr·zdnÈ a umÌstÏte pomocÌ myπi; pozice nebude uloæena)

source: coordinate type
cs: typ sou¯adnic

source: align text with coordinate point
cs: zarovn·nÌ textu na z·kladÏ sou¯adnic bodu

source: (for coordinates, % is from bottom left of display, pixels from top left)
cs: (pro sou¯adnice, % je br·n od dolnÌho levÈho rohu, pixely od hornÌho levÈho)

source: text rotation (degrees counterclockwise)
cs: otoËenÌ textu (stupnÏ proti smÏru hodinov˝ch ruËiËek)

source: rotation in radians
cs: otoËenÌ v radi·nech

source: Font:
cs: PÌsmo:

source: color
cs: barva

source: height in pixels instead of %
cs: v˝πka v pixelech namÌsto %

source: draw grid
cs: vykreslit m¯Ìæku

source: geodetic grid
cs: zemÏpisn· m¯Ìæka

source: grid color
cs: barva m¯Ìæky

source: Help for grids
cs: N·povÏda pro tvorbu m¯Ìæky

source: grid color
cs: barva m¯Ìæky

source: draw grid border
cs: zobrazit r·meËek m¯Ìæky

source: draw border text
cs: vykreslit popisek r·meËku

source: border & text color
cs: barva r·meËek & textu

source: draw geodesic line
cs: vykreslit geodetickou Ë·ru

source: Help for geodesic lines
cs: N·povÏda pro geodetickÈ Ë·ry

source: draw rhumbline
cs: vykreslit rhumbline

source: Help for rhumblines
cs: N·povÏda pro rthumblines

source: Raster map for legend:
cs: Rastrov· mapov· vrstva pro legendu:

source: Display legend in monitor:
cs: Zobrazit legendu na monitoru:

source: erase monitor before drawing legend
cs: smazat obsah monitoru p¯ed vykreslenÌm legendy

source: do not show cat labels
cs: nezobrazovat popisek kategorie

source: do not show cat numbers
cs: nezobrazovat ËÌsla kategorie

source: skip cats with no labels
cs: p¯eskoËit kategorie bez popisk˘

source: draw smooth gradient
cs: zobrazit vyhrazen˝ gradient

source: flip legend
cs: zrcadlit legendu

source: red (RGB) or hue (HIS):
cs: Ëerven· (RGB) nebo jas (HIS)

source: green (RGB) or intensity (HIS):
cs: zelen· (RGB) nebo intenzita (HIS)

source: blue (RGB) or saturation (HIS):
cs: modr· (RGB) nebo sytost (HIS):

source: display maps as RGB
cs: zobrazit mapy jako RGB

source: Help for RGB
cs: N·povÏda pro RGB

source: display maps as HIS
cs: zobrazit mapy jako HIS

source: Help for HIS
cs: N·povÏda pro HIS

source: Vector map:
cs: Vektorov· mapov· vrstva:

source: vector type
cs: vektorov˝ typ

source: Thematic map: type
cs: TÈmatick· mapa: typ

source: map by
cs: mapa

source: point color
cs: barva bodu

source: line color
cs: barva linie

source: Graduate colors: preset color schemes
cs: OdstupÚovanÈ barvy: uveÔte schÈma barev

source: draw border
cs: vykreslit hranice

source: save thematic colors to GRASSRGB column of vector file
cs: uloæit barvy tÈmatickÈ mapy do GRASSRGB sloupce vektorovÈho souboru

source: create graphic legend
cs: vytvo¯it grafickou legendu

source: use math notation in legend
cs: pouæÌt v legendÏ matematickou notaci

source: select monitor for legend
cs: vybrat grafick˝ monitor pro legendu

source: Loading GIS Manager
cs: Nahr·t GIS Manager

source: Done
cs: Hotovo.

source: Welcome to the GRASS GIS manager
cs: VÌtejte v GRASS GIS manageru

source: Opaque
cs: Nepr˘hledn˝

source: Transparent
cs: Pr˘hledn˝

source: place with mouse
cs: umÌstit myπÌ

source: Scale appearance: text color
cs: Vzhled mÏ¯Ìtka: barva textu

source: background color
cs: barva pozadÌ

source: transparent background
cs: pr˘hlednÈ pozadÌ

source: display N. arrow only
cs: zobrazit pouze smÏrovou r˘æici

source: line scale instead of bar
cs: LiniovÈ namÌsto prouækovÈho mÏ¯Ìtka

source: vector map to chart
cs: vektorov· mapa jako graf

source: show attribute columns
cs: zobrazit atributovÈ sloupce

source: show attribute data
cs: zobrazit atributov· data

source: chart outline color:
cs: barva okraje grafu

source: Text to display:
cs: Text k zobrazenÌ:

source: Text placement: x,y coordinates (from upper left)
cs: UmÌstÏnÌ textu: sou¯adnice x,y (zleva-naho¯e)

source: coordinate type for text placement
cs: typ sou¯adnic pro umÌstÏnÌ textu

source: align text with coordinate point
cs: zarovn·nÌ textu na z·kladÏ sou¯adnic bodu

source: text rotation (degrees)
cs: otoËenÌ textu (stupnÏ)

source: Text options: font type
cs: Volby textu: font

source: GRASS stroke fonts
cs: StylovÈ fonty GRASSu

source: TrueType fonts from x11 directory
cs: Fonty TrueType z adres·¯e X11

source: Other
cs: JinÈ

source: Custom font path
cs: VlastnÌ cesta k font˘m

source: select font for text (default is GRASS romans)
cs: vyberte pÌsmo pro text (v˝chozÌ je GRASS romans)

source: text height in pixels
cs: v˝πka textu v pixelech

source: line spacing
cs: ¯·dkov·nÌ

source: remove all frames
cs: odstranit vπechny r·mce

source: Create/replace vector group
cs: Vytvo¯it/nahradit vektorovou skupinu

source: group name
cs: n·zev skupiny

source: Select existing vector group or name new group
cs: Vybrat existujÌcÌ vektorovou skupinu nebo n·zev novÈ skupiny

source: vector
cs: vektorov· vrstva

source: Select xy vector(s) for group
cs: Vybrat xy vektorovou vrstvu/y pro skupinu

source: Vector group
cs: Vektorov· skupina

source: Georeference raster
cs: Georeferencov·nÌ rastrovÈ vrstvy

source: Georeference vector
cs: Georeferencov·nÌ vektorovÈ vrstvy

source: 1. Select mapset
cs: 1. Vybrat mapset

source: Mapset of xy raster group
cs: Mapset xy rastrovÈ skupiny

source: 2. Create/edit group
cs: 2. Vytvo¯it/modifikovat skupinu

source: Create/edit group (rasters or vectors to georectify)
cs: Vytvo¯it/modifikovat skupinu (rastrovÈ nebo vektorovÈ vrstvy pro georektifikov·nÌ)

source: 3. Select group
cs: 3. Vybrat skupinu

source: Select existing group to georectify
cs: Vybrat existujÌcÌ skupinu pro georektifikov·nÌ

source: 4. Select ref. map
cs: 4. Vybrat ref. mapovou vrstvu

source: Select raster or vector to display for marking ground control points
cs: Vybrat rastrovou nebo vektorovou vrstvu jako podklad pro oznaËenÌ vlÌcovacÌch bod˘

source: 5. Start georectifying
cs: 5. Spustit proces georektifikov·nÌ

source: Start georectifying
cs: Spustit proces georektifikov·nÌ

source: Cancel georectification
cs: UkonËit orthorektifikaci

source: Select rectification method for rasters
cs: Vybrat metodu georektifikace pro rastrovou vrstvu

source: 1st order
cs: prvnÌ stupeÚ

source: affine transformation (rasters & vectors). Requires 3+ GCPs.
cs: afinnÌ transformace (rasttovÈ & vektorovÈ vrstvy). Vyæaduje nejmÈnÏ 3 vlÌcovacÌ body.

source: 2nd order
cs: druh˝ stupeÚ

source: polynomial transformation (rasters only). Requires 6+ GCPs.
cs: polynomnÌ transformace (pouze rastrovÈ vrstvy). Vyæaduje minim·lnÏ 6 vlÌcovacÌch bod˘.

source: 3rd order
cs: t¯etÌ stupeÚ

source: polynomial transformation (rasters only). Requires 10+ GCPs.
cs: polynomnÌ transformace (pouze rastrovÈ vrstvy). Vyæaduje minim·lnÏ 10 vlÌcovacÌch bod˘.

source: Use
cs: PouæÌt

source: xy coordinates
cs: sou¯adnice xy

source: geographic coordinates
cs: zemÏpisnÈ sou¯adnice

source: forward error
cs: dop¯edn· chyba

source: backward error
cs: zpÏtn· chyba

source: Manage ground control points (GCPs)
cs: UrËit vlÌcovacÌ body (GCPs)

source: save GCPs to POINTS file
cs: uloæit GCPs do souboru POINTS

source: clear all unchecked GCP entries
cs: vymazat vπechny nezatræenÈ z·znamy GCP

source: calculate RMS error
cs: vypoËÌtat chybu RMS (st¯ednÌ kvadratick· chyba)
